﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2014, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**        5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093         **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************


//<AMI_FHDR_START>
//----------------------------------------------------------------------
//
// Name:        SecureFlash.UNI
//
// Description:    String definitions for Security Module
//
//----------------------------------------------------------------------
//<AMI_FHDR_END>

/=#
#include "VFR.uni"

#string SECURE_FLASH_MENU_FORM_TITLE    #language eng  "Secure Flash update"
#string SECURE_FLASH_MENU_FORM_HELP     #language eng  "Secure Flash Update support"

#string STR_SECURE_FLASH_MODE           #language eng  "Signed BIOS update"
#string STR_SECURE_FLASH_KEY_STORE      #language eng  "Platform Key store"
#string STR_KEY_FILE_RSA2048            #language eng  "RSA2048"
#string STR_KEY_FILE_SHA256             #language eng  "SHA256"
#string STR_KEY_FILE_X509               #language eng  "X.509 DER"
#string STR_KEY_FILE_NA                 #language eng  "Undefined"
#string STR_SECURE_FLASH_KEY_TYPE       #language eng  "Platform Key type"
#string STR_SECURE_FLASH_KEY_DUMMY      #language eng  "Dummy"
#string STR_SECURE_FLASH_KEY_AMITEST    #language eng  "AMI Test"
#string STR_SECURE_FLASH_KEY_OEM        #language eng  "OEM"
#string STR_SECURE_FLASH_UPDATE_MODES   #language eng  "Flash update method"
#string STR_SECURE_FLASH_UPDATE_MODE1   #language eng  "Runtime,Capsule,Recovery"
#string STR_SECURE_FLASH_UPDATE_MODE2   #language eng  "Runtime,Recovery"
#string STR_SECURE_FLASH_UPDATE_MODE3   #language eng  "Runtime"
#string STR_SECURE_FLASH_LOCK           #language eng  "Flash write-protection"
//**********************************************************************
//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2014, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**        5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093         **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
